app/views/admins/super.html.erb

                        </tr>
                            <% Admin.all.each do |a| %>
---
SELECT "admins".* FROM "admins"