app/views/submissions/new.html.erb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 4]]
SELECT "users".* FROM "users" WHERE "users"."team_id" = ?  [["team_id", 4]]
---
        <h1>Choose Discussions</h1>
        <% @team = User.find(session[:user_id]).team %>