app/views/team/team.html.erb

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 43]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---

            <% Team.find(@team.id).users.each do |u| %>