app/views/team/team.html.erb


            <% @team.users.each do |u| %>
---
SELECT "users".* FROM "users" WHERE "users"."team_id" = ?  [["team_id", 43]]

            <h3>Team Discussion Information</h3>
            <% disc = Discussion.find(@team.discussion_id) %>
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT 1  [["id", 1]]

          </div>
        <% elsif Discussion.valid_discs_for(@team).count == 0 %>
---
SELECT "discussions".* FROM "discussions"