app/views/group/create.html.erb

SELECT "groups".* FROM "groups"
---
              var limit = 1;
              $('input.group_checkbox').on('change', function(evt) {
                 if($(this).siblings(':checked').length >= limit) {
                     this.checked = false;
                 }
              });

SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT 1  [["id", 1]]
---
                  <td>Approved</td>
                  <% d = Discussion.find_by_id(t.discussion_id) %>