app/views/group/create.html.erb

SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", 2]]
---
                  <td>Pending</td>
                  <% s = Submission.find_by_id(t.submission_id) %>