app/views/group/index.html.erb

                  <td>Approved</td>
                  <% d = Discussion.find_by_id(t.discussion_id) %>
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT 1  [["id", 1]]

                  <td>Pending</td>
                  <% s = Submission.find_by_id(t.submission_id) %>
---
SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", 1]]