app/controllers/admins_controller.rb

SELECT "groups".* FROM "groups"
---
  def index
    status = params[:status]
    @status = status
    @teams_li = Team.filter_by(status)

    puts "---"
    puts Group.all.inspect

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "teams" SET "discussion_id" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["discussion_id", 3], ["updated_at", "2017-10-21 05:46:22.568525"], ["id", 2]]
---
  def approve
    @team = Team.find_by_id(params[:team_id])
    @team.approved = true
    @team.save!

SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "teams" SET "approved" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["approved", "f"], ["updated_at", "2017-10-21 19:08:02.237276"], ["id", 1]]
---
  def undo_approve
    @team = Team.find_by_id(params[:team_id])
    @team.approved = false
    @team.save!

DELETE FROM "submissions"
DELETE FROM "discussions"
---
  def reset_database
    @reset_password = params[:reset_password]
    if @reset_password == ENV["ADMIN_DELETE_DATA_PASSWORD"]
      #AdminMailer.all_data(@admin).deliver_now if not Rails.env.test?
      User.delete_all
      Team.delete_all
      Submission.delete_all
      Discussion.delete_all

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 9]]
---
  def set_admin
    @admin = Admin.find_by_id session[:user_id]