app/controllers/discussion_controller.rb

SELECT "discussions".* FROM "discussions"
---
   def index
      @discussions = Discussion.all