app/controllers/group_controller.rb

    def merge
        puts "hello"
        puts "________________"
        teams = []
        dis = ""
        for i in params
            if i[1] == {"selected"=>"1"}
                team_int = i[0].to_i
                team = Team.where({:id => team_int})
                team.each do |t|
                    teams.push(t.id)
                    puts t
                    dis = t.discussion_id
                end
            end
        end
        Group.create({:team1_id => teams[0], :team2_id => teams[1], :discussion_id => dis})
        puts Group.all.inspect
---
SELECT "groups".* FROM "groups"