app/controllers/group_controller.rb

    def index
        # status = params[:status]
        # @status = status
        # @teams_li = Team.filter_by(status)

        # teams = []
        # @teams_li.each do |t|
        #     if Group.has_team?(t.id, t.discussion_id)
        #         teams.push(t)
        #     end
        # end
        # teams.each do |t|
        #     @teams_li.delete(t)
        # end
        @groups_li = Group.all
---
SELECT "groups".* FROM "groups"

    def merge
        teams = []
        discussions = Set.new
        for i in params
            if i[1] == {"selected"=>"1"}
                team = Team.where({:id => i[0].to_i})
                team.each do |t|
                    teams.push(t.id)
                    discussions.add(t.discussion_id)
                    @dis = t.discussion_id
                end
            end
        end

        if discussions.size == 1 and teams.length == 2
            Group.create({:team1_id => teams[0], :team2_id => teams[1], :discussion_id => @dis})
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]
SELECT "teams".* FROM "teams"
INSERT INTO "groups" ("team1_id", "team2_id", "discussion_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["team1_id", 1], ["team2_id", 2], ["discussion_id", 2], ["created_at", "2017-10-22 08:04:35.844154"], ["updated_at", "2017-10-22 08:04:35.844154"]]