app/controllers/session_controller.rb

  def new
    id = session[:user_id]
    if id.nil?
      render 'new'
    elsif session[:is_admin]
      return redirect_to admin_path(:id => session[:user_id])
    else
      user = User.find_by_id(id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 6]]

  def create
    @user = User.find_by_email(params[:email])
    @admin = Admin.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "kbromyonas@berkeley.edu"]]
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT 1  [["email", "kbromyonas@berkeley.edu"]]