app/controllers/submissions_controller.rb

    def create
        @user = User.find_by_id(session[:user_id])
        @team = Team.find_by_id(@user.team.id)
        @submission = Submission.new(submission_params)
        @submission.save!
        # TODO : email that submission has been created?
        @team.update(submitted: true)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 4]]
SELECT "users".* FROM "users" WHERE "users"."team_id" = ?  [["team_id", 4]]
INSERT INTO "submissions" ("disc1id", "disc2id", "disc3id", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["disc1id", 3], ["disc2id", 2], ["disc3id", 1], ["team_id", 4], ["created_at", "2017-10-21 21:10:55.805861"], ["updated_at", "2017-10-21 21:10:55.805861"]]
UPDATE "teams" SET "submission_id" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["submission_id", 4], ["updated_at", "2017-10-21 21:10:55.847327"], ["id", 4]]