app/controllers/team_controller.rb

  def show
    @discussions = Discussion.valid_discs_for(@team)
    if @team.submitted and !(@team.approved)
      @s = Submission.find(@team.submission_id)
      @d1 = Discussion.find(@s.disc1id)
---
SELECT  "submissions".* FROM "submissions" WHERE "submissions"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = ? LIMIT 1  [["id", 1]]

  def unsubmit
    @submission = @team.submission
    @submission.destroy!
---
DELETE FROM "submissions" WHERE "submissions"."id" = ?  [["id", 4]]

  def set_user
    if session[:is_admin]
      @user = Admin.find(session[:user_id])
    elsif session[:user_id]
      @user = User.find(session[:user_id])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 41]]
SELECT "users".* FROM "users" WHERE "users"."team_id" = ?  [["team_id", 43]]

  def set_team
    @team = Team.find_by_id(params[:id])
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT 1  [["id", 43]]