app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "sid", "major", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    #either creates the passed in schedule or a singleton
    @user.schedule = Schedule.new(schedule_params)
    @user.skill_set = SkillSet.new(skill_set_params)

    if @user.save

INSERT INTO "teams" ("passcode", "approved", "submitted", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["passcode", "AQ7Na4w3ruFcMq7zqDwEuIMEb5G7xabKasVl4j_8srguuuFm"], ["approved", "f"], ["submitted", "f"], ["created_at", "2017-10-21 20:59:09.978860"], ["updated_at", "2017-10-21 20:59:09.978860"]]
---
  def start_team
    @user.leave_team if !(@user.team.nil?)

    @team = Team.new(:passcode => Team.generate_hash, :approved => false, :submitted => false)

    @team.users << @user

SELECT  "teams".* FROM "teams" WHERE "teams"."passcode" = ? LIMIT 1  [["passcode", "wack"]]
SELECT  1 AS one FROM "teams" WHERE ("teams"."passcode" = 'wack' AND "teams"."id" != 4) LIMIT 1
UPDATE "users" SET "team_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["team_id", 4], ["updated_at", "2017-10-21 21:10:01.005926"], ["id", 10]]
---
  def join_team
    @passcode = params[:team_hash]
    @team = Team.find_by_passcode(@passcode)
    @team ||= Team.new()
    return redirect_to without_team_path, :notice => "Unable to join team" if @passcode.empty? or !(@team.can_join?)

    @user.leave_team if !(@user.team.nil?)

    @team.users << @user
    @team.update_waitlist

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 10]]
---
  def set_user
    @user = User.find_by_id session[:user_id]